embenix/esp32c3_ble_canbus_v1/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESP_SYSTEM_SINGLE_CORE_MODE=y

